Repository: lv7777/w3c_cors
Catalog: w3c_cors-level2.tmx
Source language: en_us
Languages: ja

source: For requests to resources that have no significance other than retrieval, and where the credentials are used only to provide user-specific customization for otherwise publicly accessible information.
ja: /公開情報ではないユーザー固有のカスタマイズのみに使用している資格情報/を持ち検索以外の意図を持ってないリソースへのリクエストのために。

source: For the purposes of this section each resource is bound to the following:
ja: このセクションの目的のためにリソースは以下と結びついている(関係がある)。

source: Given the difficulty of avoiding such vulnerabilities in multi-origin interactions it is recommended that, instead of using user credentials automatically attached to the request by the user agent, security tokens which specify the particular capabilities and resources authorized be passed as part of the explicit content of a request.
ja: 上記のような相互の複数のオリジンによる脆弱性を避けるのは難しく、代わりにUAのリクエストに自動的にアタッチされるユーザー資格情報、特定の機能やリクエストの明示的なコンテンツの一部として渡された認証されたリソースを指定するセキュリティトークンを使用する。

source: Go to the next step if the following conditions are true:
ja: もし以下の条件がtrueの場合、次のステップに進める:

source: HTTP/1.1 currently does not make leading OWS implied in header value definitions but that form is assumed here.
ja: HTTP/1.1 は現在暗示的にヘッダの値の定義にOWSを使用しないがここの形式ではOWSを想定している。

source: HTTP/1.1 is used as ABNF basis to ensure that the new headers have equivalent parsing rules to those introduced in that specification.
ja: この仕様で導入される新しいヘッダが同等の解析ルールを持つことを保障するためにHTTP/1.1 をABNFの基本とする。

source: Handle analogous to requests where some kind of error occurred.
ja: なにかのエラーが起きたリクエストの処理と似た処理です。

source: Handle analogous to requests where the user aborted the request.
ja: ユーザーがリクエストを中断した時の処理と似た処理です。

source: Holds the request URL.
ja: request URLを保持する。

source: Holds the source origin.
ja: source originを保持する。

source: Holds the Access-Control-Max-Age header value.
ja: Access-Control-Max-Ageのヘッダの値を保持する。

source: However, the few definitions that did not really fit anywhere else are defined here instead.
ja: しかし、いくつかの用語はどこにも定義されていない。そのような語はここで定義されている。

source: I.e. if the block cookies flag is unset, cookies will be set by the response.
ja: 例 block cookies flag が未設定の場合、クッキーがレスポンスにセットされる。

source: I.e. the cross-origin request status value does not indicate that the request has completed.
ja: 例えば cross-origin request status の値がリクエストが完了したことを示しません。

source: If author request headers is not empty include an Access-Control-Request-Headers header with as header field value a comma-separated list of the header field names from author request headers in lexicographical order, each converted to ASCII lowercase (even when one or more are a simple header).
ja: もし author request headers が空でない場合、 author request headers のフィールド名をASCII lowercaseに変換して辞書式順序でコンマ区切りのリストとした値を使ったAccess-Control-Request-Headers ヘッダ を含める (リクエストがsimple headerの時でさえも)。

source: If parsing failed apply the cache and network error steps.
ja: もし解析に失敗した場合、cache and network error stepsを適用する。

source: If parsing failed do not set any additional headers and terminate this set of steps.
ja: もし構文解析に失敗した場合、追加のヘッダをセットしてなならず、この一連の手順を終了する。

source: If request method is not a case-sensitive match for any method in methods and is not a simple method, apply the cache and network error steps.
ja: もしrequest methodがmethods内のメソッドにcase-sensitiveマッチせず、なおかつそれがsimple methodではない場合、cache and network error stepsを適用する。

source: If method is a simple method this step may be skipped.
ja: メソッドが単純なメソッドの場合、この手順を省略することができる。

source: If method is not a case-sensitive match for any of the values in list of methods do not set any additional headers and terminate this set of steps.
ja: もしメソッドがlist of methods内の何かの値とcase-sensitive マッチしなかった場合、どんな追加のヘッダもセットしてはならず、この一連のステップを終了する。

source: If methods is still the empty list and the force preflight flag is set, append the request method to methods.
ja: もし methods がまだ空のリストであり、 force preflight flag がセットされている場合、request methodをmethodsに追加する。

source: If a header field name is a simple header and is not Content-Type, it is not required to be listed.
ja: ヘッダフィールド名がsimple header であり、 Content-Typeがない場合、これをリスティングする必要はない。

source: If a method is a simple method it does not need to be listed, but this is not prohibited.
ja: メソッドが単純なメソッドの場合、リスティングする必要はないが、禁止されていない。

source: If a resource author has a simple text resource residing at http://example.com/hello which contains the string "Hello World!" and would like http://hello-world.example to be able to access it, the response combined with a header introduced by this specification could look as follows:
ja: "Hello World!" という文字列が書かれているシンプルなテキストが http://example.com/helloのパスに置かれていて http://hello-world.exampleからのアクセスを許可したい場合、この仕様で導入されたヘッダの組み合わせのレスポンスは以下のようになる。:

source: If any of the header field-names is not a ASCII case-insensitive match for any of the values in list of headers do not set any additional headers and terminate this set of steps.
ja: もし 何かのヘッダフィールド名 がlist of headers内のいずれかの値に ASCII case-insensitive マッチしない場合、追加のヘッダを設定してはならない。そしてこの一連の流れを終了する。

source: If each of the header field-names is a simple header and none is Content-Type, this step may be skipped.
ja: 各header field-names が simple header であり、 Content-Typeがnoneならこの手順を省略することができる。

source: If for some reason the user agent does not want to make the request terminate this algorithm and set the cross-origin request status to network error.
ja: もし何かの事情のためにUAがリクエストを送りたくない場合、このアルゴリズムを終了させて、 cross-origin request status を network errorにする。

source: If for some reason the user agent is unable to provide a preflight result cache (e.g. because of limited disk space) go to the next step in the overall set of steps (i.e. the actual request).
ja: もし何らかの理由(例：ディスク容量が制限されているなど)でUAがpreflight result cacheを提供できない場合、次のステップに進む (例：actual requestなど)。

source: If it returns fail, apply the cache and network error steps.
ja: もし失敗した場合、cache and network error stepsを適用する。

source: If it returns fail, apply the network error steps.
ja: もし失敗と判定された場合、network error stepsを適用する

source: If needed, such resources can implement access control and CSRF protections as described above.
ja: もし必要なら、そのようなリソースに上記のようなアクセスコントロールやCSRFプロテクションを付加することができる。

source: If resources are set up like this, attackers would effectively have to be on the list of origins to do harm.
ja: リソースがこのように設定されている場合、攻撃者は実際に害を与えるためには list of origins にいる必要があります。

source: If such an API is used on http://example.org resources, a resource on http://hello-world.example can opt in using the mechanism described by this specification (e.g., specifying Access-Control-Allow-Origin: http://example.org as response header), which would allow that resource to be fetched cross-origin from http://example.org.
ja: もしそのようなAPIが http://example.org 上のリソースで使用されているとき、http://hello-world.example上のリソースはこの仕様書で述べられているhttp://example.orgから上記のリソースを取得するのを許可するようなメカニズム(例： レスポンスヘッダ内で Access-Control-Allow-Origin: http://example.orgヘッダを使用するなど)を使用することもできます。

source: If the list of exposed headers is not empty add one or more Access-Control-Expose-Headers headers, with as values the header field names given in the list of exposed headers.
ja: もし list of exposed headers が空ではない場合、1以上のi Access-Control-Expose-Headersヘッダを付け加えて list of exposed headersで与えられているヘッダフィールド名を値として用いる。

source: If the manual redirect flag is unset and the response has an HTTP status code of 301, 302, 303, 307, or 308
ja: もしmanual redirect flag が未設定で、レスポンスのHTTPステータスコードが 301, 302, 303, 307, or 308のいづれかの場合

source: If the omit credentials flag is unset and the Access-Control-Allow-Credentials header value is not a case-sensitive match for "true", return fail and terminate this algorithm.
ja: もし omit credentials flag がセットされておらず、レスポンスに0以上のAccess-Control-Allow-Credentials ヘッダの値が"true"にcase-sensitive マッチしない場合、失敗と判断しこのアルゴリズムを終了する。

source: If the omit credentials flag is unset and the response includes zero or more than one Access-Control-Allow-Credentials header values, return fail and terminate this algorithm.
ja: もし omit credentials flag がセットされておらず、レスポンスに0以上のAccess-Control-Allow-Credentials ヘッダの値が含まれている場合、失敗と判断しこのアルゴリズムを終了する。

source: If the request URL origin is not same origin with the original URL origin, set source origin to a globally unique identifier (becomes "null" when transmitted).
ja: もしリクエストURLのoriginが original URL originとsame originでない場合、 set source origin に (送信時に "null" になる)globally unique identifier を設定する。

source: If the request URL <scheme> is not supported, infinite loop precautions are violated, or the user agent does not wish to make the new request for some other reason, apply the network error steps.
ja: もし要求するURL <scheme> がサポートされていない場合、無限ループを防止する、もしくはそのほかの理由によりUAが新しいリクエストを作成したくない場合、 network error stepsを適用する。

source: If the request URL contains the userinfo production apply the network error steps.
ja: もし要求するURLにユーザー認証情報が含まれていた場合、network error stepsを適用する。

source: If the resource sharing check for the current resource returns fail, apply the network error steps.
ja: もし現在のリソース共有チェックが失敗と判定された場合、network error stepsを適用する。

source: If the resource sharing check returns fail, apply the cache and network error steps.
ja: もしリソース共有チェック が失敗した場合、 cache and network error stepsを適用する。

source: If the Access-Control-Allow-Origin header value is the "*" character and the omit credentials flag is set, return pass and terminate this algorithm.
ja: もしAccess-Control-Allow-Origin ヘッダの値が文字 "*" であり、 omit credentials flag が設定されていた場合、成功と判断しこのアルゴリズムを終了する。

source: If the Origin header is not present terminate this set of steps.
ja: もしOrigin ヘッダが存在しない場合、この一連の流れを終了する。

source: If the end user cancels the request
ja: もしエンドユーザーがリクエストをキャンセルした場合

source: If the field name of each header in author request headers is not an ASCII case-insensitive match for one of the header field names in headers and the header is not a simple header, apply the cache and network error steps.
ja: author request headers内のそれぞれのヘッダのフィールド名が headers 内のヘッダフィールド名の一つにASCII case-insensitive マッチせず、そのヘッダがsimple headerではない場合、cache and network error stepsを適用する。

source: If the following conditions are true, follow the simple cross-origin request algorithm:
ja: 以下の条件が真の場合、 simple cross-origin request アルゴリズムに従う必要がある。(note:途中から？たぶん最初から。)：

source: If the header does not match the production it is said that header parsing failed.
ja: もしヘッダがこの仕様書で述べられているどんなABNFにもマッチしない場合、ヘッダ解析に失敗したと言われる。

source: If the resource supports credentials add a single Access-Control-Allow-Origin header, with the value of the Origin header as value, and add a single Access-Control-Allow-Credentials header with the case-sensitive string "true" as value.
ja: もしリソースが資格情報をサポートしている場合、 単体の Access-Control-Allow-Origin ヘッダを付け加えて、値には、 Origin ヘッダの値と同等の値を書き込み。さらに単体の Access-Control-Allow-Credentials ヘッダを付け加えて、値には文字列 "true" とcase-sensitive する値を書き込む。

source: If the resource has been relocated, it indicates whether to share its new URL.
ja: もしリソースが再配置されていた場合、これは新しい URLを共有かどうか指示する。

source: If the response has an HTTP status code of 301, 302, 303, 307, or 308
ja: もしレスポンスの HTTP ステータスコードが 301, 302, 303, 307, 308のいずれかを持っている場合

source: If the response has an HTTP status code that is not in the 2xx range
ja: もしレスポンスのHTTPステータスコードが2XXの範囲ではない場合

source: If the response includes zero or more than one Access-Control-Allow-Origin header values, return fail and terminate this algorithm.
ja: もしリソースが0以上のAccess-Control-Allow-Origin ヘッダの値を含んでいた場合、失敗と判断しこのアルゴリズムを終了する。

source: If the user agent imposes a limit on the max-age field value and max-age is greater than that limit let max-age be the limit.
ja: もしUAが max-age フィールド値に制限を課し、max-ageがその値より大きい場合、max-ageの値を上限に設定する(max-ageの上限を超えた場合上限にする)。

source: If the value of Access-Control-Allow-Origin is not a case-sensitive match for the value of the Origin header as defined by its specification, return fail and terminate this algorithm.
ja: もしAccess-Control-Allow-Originの値がこの仕様書で定義されているOrigin ヘッダの値に case-sensitive マッチしない場合、失敗と判断しこのアルゴリズムを終了する。

source: If the value of the Origin header is not a case-sensitive match for any of the values in list of origins do not set any additional headers and terminate this set of steps.
ja: もし Origin ヘッダの値がlist of origins内の値に case-sensitive マッチしなかった場合、追加のヘッダをセットせず、この一連の流れを終了する。

source: If the value of the Origin header is not a case-sensitive match for any of the values in list of origins, do not set any additional headers and terminate this set of steps.
ja: もし Origin ヘッダの値が list of origins内の何らかの値にcase-sensitive マッチ しない場合、追加のヘッダを設定してはいけない。そしてこの一連の流れをを終了する。

source: If there are no Access-Control-Request-Headers headers let header field-names be the empty list.
ja: もしそこにAccess-Control-Request-Headers ヘッダが存在しなかった場合、ヘッダフィールド名を空のリストにする。

source: If there are one or more Access-Control-Allow-Headers headers let headers be the values as result of parsing the headers.
ja: もし一つ以上の Access-Control-Allow-Headers ヘッダが存在する場合headers の値をヘッダを解析した結果にする。

source: If there are one or more Access-Control-Allow-Methods headers let methods be the values as result of parsing the headers.
ja: もし1以上のAccess-Control-Allow-Methodsヘッダが存在する場合、methodsの値を、このヘッダを 解析した結果にする。

source: If there is a network error
ja: ネットワークエラーが起こった場合

source: If there is a single Access-Control-Max-Age header, parse it and let max-age be the resulting value.
ja: もし単一の Access-Control-Max-Age ヘッダがある場合、ヘッダを解析 し、max-ageを結果の値にする。

source: If there is no Access-Control-Request-Method header or if parsing failed, do not set any additional headers and terminate this set of steps.
ja: もし no Access-Control-Request-Methodヘッダが存在しなかったり解析に失敗した場合、どんな追加のヘッダも追加してはならない。その後、この一連のステップを終了する。

source: If there is no such header, there is more than one such header, or parsing failed, let max-age be a value at the discretion of the user agent (zero is allowed).
ja: もしそのようなヘッダが存在しなかったり、１より多い数のヘッダが存在して parsing failedした場合、 max-age の値をUAの選んだ適切な値にする(0も許可される)。

source: If you wish to make comments regarding this document, please send them to public-webappsec@w3.org (subscribe, archives).
ja: この文書にコメントするには、public-webappsec@w3.org （購読, アーカイブ）に電子メールを送信されたい。

source: In XMLHttpRequest progress events are dispatched only after the cross-origin request status is set to success.
ja: XMLHttpRequest プログレスイベントはcross-origin request statusがsuccessになった後にのみ発行される。

source: In addition to checking the Origin header, resource authors are strongly encouraged to also check the Host header.
ja: In addition to checking the Originヘッダのチェックに加えて、リソースの作者には、Hostヘッダをチェックすることも強く推奨する。

source: In addition, for the coming forty-two minutes, no preflight request will be needed.
ja: 加えて、今から42分間は preflight request は必要ではなくなる。

source: In case a CORS API specification defines multiple APIs that utilize the policy the advice is to be considered separately for each API.
ja: In case a CORS API 仕様書がポリシーを使用する複数のAPIを定義していた場合、このアドバイスはそれぞれのAPIごとに考慮する。

source: In case of DNS errors, TLS negotiation failure, or other type of network errors, apply the network error steps.
ja: DNS エラー、 TLS ネゴシエーションの失敗、それ以外のタイプのネットワークエラーが発生した場合、 network error stepsを適用する。

source: In practice the origin-list-or-null production is more constrained.
ja: 実際には、値 origin-list-or-null はより制約的である。

source: In response to a preflight request the resource indicates which methods and headers (other than simple methods and simple headers) it is willing to handle and whether it supports credentials.
ja: preflight request のレスポンス内で、リソースはどのメソッドとヘッダ( simple methods や simple headers以外の)を処理できるか、リソースが資格情報をサポートしているかどうかなどを決定する。

source: In response to a simple cross-origin request or actual request the resource indicates whether or not to share the response.
ja: simple cross-origin request や actual request のレスポンス内で、リソースがこのリソースを公開するかどうかを指示する。

source: In such cases, passing security tokens explicitly as part of the cross-origin request can remove any ambiguity as to the scope of authorization.
ja: このような場合、曖昧な許可している範囲を削除できるクロスオリジンリクエストリクエストの一環としてセキュリティトークンを明示的に渡す。

source: In such multi-origin scenarios, a malicious resource at one of the origins may be able to enlist the user-agent as a confused deputy and elevate its privileges by abusing user credentials sent with cross-origin requests.
ja: このようなマルチオリジンのシナリオでは、一つのオリジンの悪意のあるリソースがUAを混乱した代理(https://ja.wikipedia.org/wiki/Confused_deputy_problem)として登録し、悪意のあるユーザー資格情報をクロスオリジンリクエストで送信することで、権限を昇格することができるかもしれない。

source: In that case the author needs to reply to a preflight request that uses the OPTIONS method and then needs to handle the actual request that uses the desired method (DELETE in this example) and give an appropriate response.
ja: その場合にはプリフライトリクエストにOPTIONSメソッドを使用してレスポンスを返し、その後(DELETE などの)使用したいメソッドを使った実際のリクエストを処理して適切なレスポンスを返す必要があります。

source: In this case, restricting access to certain origins may protect user privacy by preventing customizations from being used to identify a user, except at authorized origins.
ja: その場合、特定のオリジンを制限されたアクセスは認証されたオリジンを除き、ユーザーを識別することに使用されているカスタマイズを防止することによってユーザーのプライバシー保護する。.

source: In this specification, The words must and may are to be interpreted as described in RFC 2119.
ja: この仕様書では、単語はRFC 2119の仕様で説明されているものとして解釈する。

source: In user agents that follow this pattern, network requests typically include user credentials with cross-origin requests, including HTTP authentication and cookie information.
ja: 上のパターンが適用されるユーザーエージェントには、HTTP認証や cookie 情報などのユーザーの資格情報が含まれる典型的なネットワークリクエストがあります。

source: Include an Access-Control-Request-Method header with as header field value the request method (even when that is a simple method).
ja: 値がrequest method の Access-Control-Request-Method ヘッダを含める (リクエストが simple methodの時でさえも)。

source: It also provides a short description of the function of each header.
ja: ここではそれぞれのヘッダの機能の短い説明も提供している。

source: It can be modified during the redirect steps.
ja: これは、redirect stepsを踏む間に修正することができる。

source: It can take at most two distinct values over the course of a cross-origin request.
ja: これは cross-origin requestの間、２つの異なった値を取ることができる。

source: It gets slightly more complicated if the resource author wants to be able to handle cross-origin requests using methods other than simple methods.
ja: もしリソースの作者がsimple methods以外のメソッドでクロスオリジンリクエストを使用できるようにしたいと思った場合、もう少し複雑になります。

source: It includes advice for specifications that define APIs that use the cross-origin request algorithm defined in this specification — CORS API specifications — and the general security considerations section includes some advice for client-side Web application authors.
ja: これには — CORS API specifications — などのこの仕様書の中で定義されているcross-origin requestアルゴリズムで使用するAPIを定義する仕様書へのアドバイスや通常のクライアント側のウェブアプリケーションの作者に向けたいくつかのアドバイスが含まれている security considerationsセクションが含まれている。

source: It is a stable document and may be used as reference material or cited from another document.
ja: これは安定した文書であり、規範的仕様として使用されてもよく、他の文書から引用してもよい。

source: It is often appropriate for resources to require an authorization ceremony which explicitly asks for a user to consent that cross-origin requests with credentials be honored from a given origin.
ja: しばしばリソースが明示的に特定のオリジンから機密情報を使用したクロスオリジンリクエストへの同意をユーザーに求めるような認証のための通過儀礼(動作)を必要とすることがあるがこれは適切である。

source: It is true when the resource does and false otherwise.
ja: リソースがサポートする場合はtrueであり、それ以外の場合はfalseになる。

source: Let request URL be the URL conveyed by the Location header in the redirect response.
ja: request URLをURL conveyed by the Location header in the redirect response.

source: Let header field-names be the values as result of parsing the Access-Control-Request-Headers headers.
ja: ヘッダフィールド名をAccess-Control-Request-Headersヘッダの解析した結果の値にする。

source: Let headers be the empty list.
ja: headers が空のリストにする。

source: Let method be the value as result of parsing the Access-Control-Request-Method header.
ja: methodを Access-Control-Request-Method ヘッダを解析した結果の値にする。

source: Let methods be the empty list.
ja: methods が空のリストにする。

source: Let original URL be the request URL.
ja: original URL をrequest URLとする。（逆か？）

source: Likewise, the user agent processing model section details how user agents are to use these headers.
ja: 同様に、 user agent processing model セクションではUAがどのようにそれらのヘッダを使用するか説明する。

source: Mapping web applications to distinct origins is vital for secure web applications.
ja: 異なった オリジン にウェブアプリケーションをマッピングすることはウェブアプリケーションのセキュリティを上昇するために必要です。

source: Missing, unless explicitly set.
ja: 明示的に設定されない場合空になる。

source: No changes were made since the previous publication as Proposed Recommendation.
ja: この文書がProposed Recommendationのステータスの時から変更されていない。

source: Non-normative translations may also be available.
ja: 非標準の翻訳もあります。

source: OAuth is an example of this pattern.
ja: 以下はOAuthの例である。

source: Optionally add a single Access-Control-Max-Age header with as value the amount of seconds the user agent is allowed to cache the result of the request.
ja: オプションとして、ＵＡがリクエストの結果をキャッシュするのを許可する秒数を値とした Access-Control-Max-Age ヘッダを加えることもできる。

source: Other documents may supersede this document.
ja: 他の文書がこの文書に取って代わるかもしれない。

source: Otherwise
ja: それ以外の場合

source: Otherwise (the HTTP status code is in the 2xx range)
ja: それ以外(HTTPステータスコードが2xxの範囲に収まっている)

source: Otherwise, add a single Access-Control-Allow-Origin header, with either the value of the Origin header or the string "*" as value.
ja: そうでない場合、単体の Access-Control-Allow-Origin ヘッダを付け加えて、値には Origin ヘッダの値と同等の値か、文字列"*"のどちらかを書き込む。

source: Otherwise, follow the cross-origin request with preflight algorithm.
ja: それ以外の場合、cross-origin request with preflight アルゴリズムに従う必要がある。

source: Otherwise, if it returns pass, terminate this algorithm and set the cross-origin request status to success.
ja: それ以外の場合、もし判定が通った場合、このアルゴリズムを終了し、cross-origin request status を successに設定する。

source: Otherwise, make a preflight request.
ja: それ以外の場合、preflight requestを作成する。

source: Perform a resource sharing check.
ja: resource sharing checkを行う。

source: Please note there may be errata for this document.
ja: 発行以降に報告されたエラーまたは問題についてはエラッタを確認されたい。

source: Rather than allowing a space-separated list of origins, it is either a single origin or the string "null".
ja: originsの空白区切りのリストが許可されているというより、これは単一の オリジン、もしくは文字列"null"のどちらかである。

source: References
ja: 参考文献

source: Remove the entries in the preflight result cache where origin field value is a case-sensitive match for source origin and url field value is a case-sensitive match for request URL.
ja: origin フィールドの値が source originと case-sensitive マッチし、url フィールドの値が request URLとcase-sensitive マッチするpreflight result cache 内のエントリーを削除する。

source: Requests made with user credentials, or the Origin header require special consideration.
ja: ユーザー資格情報もしくは、 オリジンヘッダを保持しているリクエストの要求には特別な配慮が必要である。

source: Requirements phrased in the imperative as part of algorithms (e.g. "terminate the algorithm") are to be interpreted with the meaning of the key word (e.g. must) used in introducing the algorithm.
ja: アルゴリズムの中の命令的言い回しによる要件（例えば： “先頭部のスペース文字並びを取り除く”, “false を返してこの手続きを終了” など）は、アルゴリズムを導入する際に利用されているキーワード（ “〜しなければならない”, “〜すべき”, “〜してもよい”, 等々）の意味の下で解釈されることになる。

source: Resource authors are strongly encouraged to ensure that requests using safe methods, e.g. GET or OPTIONS, have no side effects so potential attackers cannot modify the user's data easily.
ja: リソースの作者には、GETやOPTIONS等のセーフメソッドによるリクエストを使うことを保証することを強く勧める。なぜならこれらのセーフメソッドは副作用を持たないため、潜在的な攻撃者がユーザーのデータを簡単に修正することができないからである。

source: Resources must use the following set of steps to determine which additional headers to use in the response:
ja: リソースはリソース内でどの追加のヘッダを使用するか決定するために以下の一連の流れを使用しなければならない。：

source: Resources that wish to enable themselves to be shared with multiple Origins but do not respond uniformly with "*" must in practice generate the Access-Control-Allow-Origin header dynamically in response to every request they wish to allow.
ja: 複数の Origins と共有を有効にしたいが、 "*" にはレスポンスを返したくないリソースの場合、実際には、許可したいすべての要求に応じて、 Access-Control-Allow-Origin </ c2>ヘッダーを動的に生成する必要がある。

source: Reviewing the XMLHttpRequest specification provides a good start for the kind of limitations that are to be imposed.
ja: XMLHttpRequest仕様書のレビューによって、課されるべき種類の制限が適切に開始されます。
